
#include <stdio.h>
#include <math.h>
#include <stdlib.h>
#include <locale.h>
int main()
{
	setlocale(LC_ALL, "Russian");
	printf("Введите координаты клетки, на которой стоит фигура, и затем координаты клетки, куда хотите поставить фигуру");
	fflush(stdout);
	int x1, y1, x2, y2;
	scanf("%d %d %d %d", &x1, &y1, &x2, &y2);
	if (abs(y1 - y2) <= 1 && abs(x2 - x1) <= 1)
	{
		printf("Вы можете походить королем на эту клетку\n");
	}
	else
	{
		printf("Вы не можете походить королем на эту клетку\n");
	}
	if ((abs(x1 - x2) == 1 && abs(y2 - y1) == 1) || (abs(x1 - x2) == 2 && abs(y2 - y1) == 2) || (abs(x1 - x2) == 3 && abs(y2 - y1) == 3) || (abs(x1 - x2) == 4 && abs(y2 - y1) == 4) || (abs(x1 - x2) == 5 && abs(y2 - y1) == 5) || (abs(x1 - x2) == 6 && abs(y2 - y1) == 6) || (abs(x1 - x2) == 7 && abs(y2 - y1) == 7))
	{
		printf("Вы можете ппоходить слоном на эту клетку\n");
	}
	else
	{
		printf("Вы не можете походить слоном на эту клетку\n");
	}
	if (x1 == x2 || y1 == y2)
	{
		printf("Вы можете походить ладьёй на эту клетку\n");
	}
	else
	{
		printf("Вы не можете походить ладьёй на эту клетку\n");
	}
	if ((abs(y1 - y2) <= 1 && abs(x2 - x1) <= 1) || ((abs(x1 - x2) == 1 && abs(y2 - y1) == 1) || (abs(x1 - x2) == 2 && abs(y2 - y1) == 2) || (abs(x1 - x2) == 3 && abs(y2 - y1) == 3) || (abs(x1 - x2) == 4 && abs(y2 - y1) == 4) || (abs(x1 - x2) == 5 && abs(y2 - y1) == 5) || (abs(x1 - x2) == 6 && abs(y2 - y1) == 6) || (abs(x1 - x2) == 7 && abs(y2 - y1) == 7)) || (x1 == x2 || y1 == y2))
	{
		printf("Вы можете походить ферзем на эут клетку\n");
	}
	else
	{
		printf("Вы не можете походить ферзем на эту клетку\n");
	}
	if ((abs(y1 - y2) == 2 && abs(x2 - x1) == 1) || (abs(y1 - y2) == 1 && abs(x2 - x1) == 2))
	{
		printf("Вы можете походить конем на эту клетку \n");
	}
	else
	{
		printf("Вы не можете походить конем на эту клетку\n");
	}

	return 0;
}
